# Задание: На вход подается непустая строка. Требуется вывести:
your_line = input()

# 1. Третий символ этой строки (считая, что нумерация символов начинается с 1)
print(your_line[2])

# 2. Предпоследний символ этой строки
print(your_line[-2])

# 3. Первые пять символов этой строки
print(your_line[0:5])

# 4. Всю строку, кроме последних двух символов
print(your_line[:-2])

# 5. Все символы с четными индексами (считая, что индексация начинается с 0);
# 6. Все символы с нечетными индексами (считая, что индексация начинается с 0);
# 7. Все символы в обратном порядке;
# 8. Все символы строки через один в обратном порядке, начиная с последнего


# 9. Длину данной строки
print(len(your_line))

# 10. Строку в нижнем регистре
print(your_line.lower())

# 11. Строку в верхнем регистре
print(your_line.upper())

#Задание: На вход подается неочищенный текст. Необходимо:
# 1) привести текст к нижнему регистру;
# 2) убрать спецсимволы и знаки пунктуации --- ['#', '$', '%', '?', ':', ':', "," ".", '-', "!"]
